import React from "react";
import { motion } from "framer-motion";

const About: React.FC = () => {
  return (
    <section id="about" className="py-16 bg-gray-50">
      <div className="container mx-auto px-6">
        <motion.h2
          className="text-2xl font-semibold text-gray-800 mb-6 text-center"
          initial={{ opacity: 0, y: -20 }}
          animate={{ opacity: 1, y: 0 }}
          transition={{ duration: 0.5 }}
        >
          О компании
        </motion.h2>
        <motion.div
          className="max-w-3xl mx-auto text-gray-600 text-base leading-relaxed"
          initial={{ opacity: 0, y: 50 }}
          animate={{ opacity: 1, y: 0 }}
          transition={{ duration: 0.5, delay: 0.2 }}
        >
          <p className="mb-4 indent-8" >
            ООО «АмурПолистиролБетон» — ведущий производитель полистиролбетонных изделий в Амурской области. Основанная в 2019 году, наша компания специализируется на изготовлении высококачественных строительных материалов, которые сочетают в себе легкость, прочность и отличные теплоизоляционные свойства. Мы ориентированы на предоставление надежных решений для строительства жилых, коммерческих и промышленных объектов.
          </p>
          <p className="mb-4 indent-8">
            Наше производство расположено в посёлке Астрахановка, вблизи Благовещенска, что позволяет нам оперативно обслуживать клиентов по всему региону. Используя современное оборудование и тщательно отобранное сырье, мы гарантируем стабильное качество продукции, соответствующее ГОСТ и строительным стандартам. Ассортимент включает полистиролбетонные блоки различных размеров, адаптированные под нужды современного строительства.
          </p>
          <p className="indent-8">
            Мы ценим доверие наших клиентов и предлагаем гибкие условия сотрудничества: фиксированные цены на заказы с возможностью хранения до начала строительного сезона, а также доставку по городу и области. Связаться с нами можно по телефонам: +7 (962) 285-51-51, +7 (4162) 55-51-51. Наша миссия — способствовать развитию экологичного и энергоэффективного строительства на Дальнем Востоке России.
          </p>
        </motion.div>
      </div>
    </section>
  );
};

export default About;